Repository: stewarthaines/stewarthaines.com
Catalog: locales/*.po
Languages: de, es, fr

# qa_opensource_q
source: Why not open source?
de: 🤖 Warum nicht Open Source?
es: 🤖 ¿Por qué no el código abierto?
fr: 🤖 Pourquoi pas open source ?

# qa_opensource_a
source: 1. I have **no experience** managing an open source project 2. I have **no enthusiasm** for learning how to manage an open source project 3. The project's source code was largely generated with a coding agent. I'm not sure which open source license would be suitable. TBD.
de: 🤖 1. Ich habe **keine Erfahrung** mit der Durchführung eines Open-Source-Projekts 2. Ich habe **keine Begeisterung** für die Ausführung eines Open-Source-Projekts 3. Ich erwarte, dass die Software, wenn sie eine Benutzergemeinschaft findet, größtenteils *keine Software-Leute * sein wird und sich nicht darum kümmert, dass sie nicht Open Source ist 4. Das Projekt wurde größtenteils mit einem LLM generiert und ich kenne noch nicht alle Konsequenzen
es: 🤖 1. No tengo **experiencia** en la ejecución de un proyecto de código abierto 2. No tengo ** entusiasmo** por ejecutar un proyecto de código abierto 3. Espero que si el software encuentra una comunidad de usuarios, en gran medida *no serán personas de software * y no les importará que no sea de código abierto 4. El proyecto se generó en gran medida con un LLM y aún no conozco todas las consecuencias de eso
fr: 🤖 1. Je n'ai **aucune expérience** dans l'exécution d'un projet open source 2. Je n'ai **aucun enthousiasme** pour la gestion d'un projet open source 3. Je m'attends à ce que si le logiciel trouve une communauté d'utilisateurs, ils ne seront en grande partie *pas des développeurs de logiciels * et ne se soucieront pas qu'il ne soit pas open source 4. Le projet a été largement généré avec un LLM et je ne connais pas encore toutes les conséquences de cela

# qa_commercial_q
source: How do I obtain a commercial license?
de: 🤖 Was ist eine kommerzielle Lizenz?
es: 🤖 ¿Qué es una licencia comercial?
fr: 🤖 Qu'est-ce qu'une licence commerciale ?

# qa_commercial_a
source: 1. Get in touch if it's worth it to you to have an agreement. Eventually contribute some money via **LiberaPay**<script src='/images/button.js'></script> <noscript><a href='https://liberapay.com/stewarthaines/donate'><img alt='Contribute using Liberapay' src='/images/contribute.svg'></a></noscript> 2. Send me an email with the invoice number so I can cross-reference it: [Email Stewart](mailto:stewarthaines+seed@gmail.com?subject=SEED.html%20Commercial%20License) 3. Receive an email from me approving your agreed commercial use of the software
de: 🤖 1. Spenden Sie etwas Geld über **LiberaPay**<script src='https://liberapay.com/stewarthaines/widgets/button.js'></script> <noscript><a href='https://liberapay.com/stewarthaines/donate'><img alt='Spenden Sie mit Liberapay' src='https://liberapay.com/assets/widgets/donate.svg'></a></noscript> 2. Senden Sie mir eine E-Mail mit der Rechnungsnummer, damit ich sie abgleichen kann: [E-Mail an Stewart](mailto:stewarthaines+seed@gmail.com?subject=SEED.html%20Commercial%20License) 3. Erhalten Sie eine E-Mail von mir, die Ihre angeforderte kommerzielle Nutzung der Software genehmigt
es: 🤖 1. Dona algo de dinero vía **LiberaPay**<script src='https://liberapay.com/stewarthaines/widgets/button.js'></script> <noscript><a href='https://liberapay.com/stewarthaines/donate'><img alt='Dona usando Liberapay' src='https://liberapay.com/assets/widgets/donate.svg'></a></noscript> 2. Envíame un email con el número de factura para que pueda hacer la referencia cruzada: [Email a Stewart](mailto:stewarthaines+seed@gmail.com?subject=SEED.html%20Commercial%20License) 3. Recibe un email mío aprobando el uso comercial solicitado del software
fr: 🤖 1. Faites un don d'argent via **LiberaPay**<script src='https://liberapay.com/stewarthaines/widgets/button.js'></script> <noscript><a href='https://liberapay.com/stewarthaines/donate'><img alt='Faire un don avec Liberapay' src='https://liberapay.com/assets/widgets/donate.svg'></a></noscript> 2. Envoyez-moi un email avec le numéro de facture pour que je puisse faire le recoupement : [Email Stewart](mailto:stewarthaines+seed@gmail.com?subject=SEED.html%20Commercial%20License) 3. Recevez un email de ma part approuvant votre demande d'utilisation commerciale du logiciel

# qa_ai_q
source: What about AI?
de: 🤖 Über was?
es: 🤖 ¿Qué pasa con eso?
fr: 🤖 A quel propos ?

# qa_ai_a
source: The SEED.html app was developed in **July and August of 2025** with extensive use of [Anthropic's Claude Code](https://claude.ai/code) product, mostly using the Sonnet 3.7 and 4 models. Claude Code is an LLM-powered coding assistant with command-line interface capabilities. The agent wrote **100% of the code and tests** for this project in a javascript framework called **Svelte 5**, which I had no prior experience with. There's no active AI in the app - it's just an HTML file that runs locally in your browser. I have no plans to make AI or llm agents part of the app.
de: 🤖 Die SEED.html -App wurde im **Juli und August 2025** unter umfassender Verwendung des Produkts [Anthropic's Claude Code](https://claude.ai/code) entwickelt, hauptsächlich mit den Sonnet 3.7- und 4-Modellen. Claude Code ist ein LLM-gestützter Programmierassistent mit Befehlszeilenschnittstellenfunktionen. Der Agent schrieb **100% des Codes und der Tests** für dieses Projekt in einem Javascript-Framework namens **Svelte 5**, mit dem ich keine Erfahrung hatte. Es war eine Reise.
es: 🤖 La aplicación SEED.html se desarrolló en **julio y agosto de 2025** con un uso extensivo del producto [Claude Code de Anthropic](https://claude.ai/code), principalmente utilizando los modelos Sonnet 3.7 y 4. Claude Code es un asistente de codificación con tecnología LLM con capacidades de interfaz de línea de comandos. El agente escribió el **100% del código y las pruebas** para este proyecto en un marco de javascript llamado **Svelte 5**, con el que no tenía experiencia previa. Ha sido un viaje.
fr: 🤖 L'application SEED.html a été développée en **juillet et août 2025** avec une utilisation intensive du produit [Code Claude d'Anthropic](https://claude.ai/code), principalement en utilisant les modèles Sonnet 3.7 et 4. Claude Code est un assistant de codage alimenté par LLM avec des capacités d'interface de ligne de commande. L'agent a écrit **100% du code et des tests** pour ce projet dans un framework javascript appelé **Svelte 5**, avec lequel je n'avais aucune expérience préalable. Ça a été un voyage.

# qa_accessibility_q
source: What about Accessibility?
de: 🤖 Was ist mit Barrierefreiheit?
es: 🤖 ¿Qué pasa con la accesibilidad?
fr: 🤖 À propos du menu Accessibilité

# qa_accessibility_a
source: The app is usable **without a mouse** (via keyboard navigation) and should support screen reader software. I'm sure it could be better. If you have something constructive to tell me please get in touch <a href='#on-mastodon'>on mastodon</a>.
de: 🤖 Die App ist **ohne Maus** (via Tastaturnavigation) nutzbar und soll Screenreader-Software unterstützen. Ich bin sicher, es könnte besser sein. Wenn du mir etwas Konstruktives zu sagen hast, wende dich bitte <a href='#on-mastodon'>an Mastodon</a>.
es: 🤖 La aplicación se puede usar **sin mouse** (a través de la navegación del teclado) y debe ser compatible con el software del lector de pantalla. Estoy seguro de que podría ser mejor. Si tienes algo constructivo que decirme, ponte <a href='#on-mastodon'>en contacto con mastodonte</a>.
fr: 🤖 L'application est utilisable **sans souris** (via la navigation au clavier) et devrait prendre en charge le logiciel de lecture d'écran. Je suis sûr que ça pourrait être mieux. Si vous avez quelque chose de constructif à me dire, veuillez me contacter <a href='#on-mastodon'>sur mastodon</a>.

# qa_markdown_textile_q
source: Markdown or Textile?
de: 🤖 Markdown oder Textil?
es: 🤖 ¿Markdown o Textil?
fr: 🤖 Markdown ou Textile ?

# qa_markdown_textile_a
source: The main reason for me using [Markdown](https://daringfireball.net/projects/markdown/) formatting is its great support in other writing tools. If you have existing workflows or preferences I'd suggest sticking with one of the Markdown libraries from the sample EPUBs. I use the [Obsidian app](https://obsidian.md/) heavily and am very comfortable with Markdown in this environment. For EPUB authoring I lean towards [Textile](https://textile-lang.com) in my projects because of: - The smaller size of the javascript library - The ease of adding attributes (like `id` and `class` and `data-src`) - A more explicit relation between the source formatting convention and the ultimate xhtml representation. I started out assuming Markdown was the only choice, but I'm coming around to using Textile in this environment. The other formats that there are samples for are interesting (Asciidoc, LaTeX )and I hope someone finds good uses for them in EPUBs.
de: 🤖 Der Hauptgrund für die Verwendung der [Markdown](https://daringfireball.net/projects/markdown/)-Formatierung ist die Unterstützung in anderen Schreibwerkzeugen. Wenn Sie bereits bestehende Arbeitsabläufe oder Präferenzen haben, würde ich empfehlen, bei einer der Markdown-Bibliotheken aus den Beispiel-EPUBs zu bleiben. Ich verwende die [Obsidian App](https://obsidian.md/) intensiv und bin sehr vertraut mit Markdown in dieser Umgebung. Für die EPUB-Erstellung tendiere ich in meinen Projekten zu [Textile](https://textile-lang.com) wegen: - Der kleineren Größe der JavaScript-Bibliothek - Der einfacheren Hinzufügung von Attributen (wie `id` und `class` und `data-src`) - Einer expliziteteren Beziehung zwischen der Quellformatierungs-Konvention und der endgültigen XHTML-Darstellung. Ich bin davon ausgegangen, dass Markdown die einzige Wahl war, aber in dieser Umgebung wende ich mich Textile zu.
es: 🤖 La razón principal para usar el formato [Markdown](https://daringfireball.net/projects/markdown/) es su soporte en otras herramientas de escritura. Si tienes flujos de trabajo existentes o preferencias, sugeriría quedarte con una de las librerías de Markdown de los EPUBs de muestra. Uso mucho [Obsidian app](https://obsidian.md/) y me siento muy cómodo con Markdown en este entorno. Para la creación de EPUB me inclino hacia [Textile](https://textile-lang.com) en mis proyectos por: - El menor tamaño de la librería de JavaScript - La facilidad de agregar atributos (como `id` y `class` y `data-src`) - Una relación más explícita entre la convención de formato fuente y la representación xhtml final. Comenzé asumiendo que Markdown era la única opción, pero me estoy inclinando hacia Textile en este entorno.
fr: 🤖 La raison principale d'utiliser le formatage [Markdown](https://daringfireball.net/projects/markdown/) est son support dans d'autres outils d'écriture. Si vous avez des flux de travail existants ou des préférences, je suggérerais de rester avec l'une des bibliothèques Markdown des EPUBs d'exemple. J'utilise beaucoup [Obsidian app](https://obsidian.md/) et je suis très à l'aise avec Markdown dans cet environnement. Pour la création d'EPUB, je penche vers [Textile](https://textile-lang.com) dans mes projets à cause de : - La plus petite taille de la bibliothèque JavaScript - La facilité d'ajouter des attributs (comme `id` et `class` et `data-src`) - Une relation plus explicite entre la convention de formatage source et la représentation xhtml finale. J'ai commencé en supposant que Markdown était le seul choix, mais je me tourne vers Textile dans cet environnement.

# qa_support_q
source: Can I get support? Where do I report bugs?
de: 🤖 Kann ich Unterstützung erhalten? Wo melde ich Fehler?
es: 🤖 ¿Puedo obtener ayuda? ¿Dónde informo de los errores?
fr: 🤖 Puis-je obtenir de l'aide ? Où dois-je signaler les bugs ?

# qa_support_a
source: I'm **not offering support** at this time. I developed the app for my own use and hope it is of interest to at least a few other people in its current form. If you find a *show-stopper* of a bug and really want to tell me about it please get in touch <a href='#on-mastodon'>on mastodon</a>.
de: 🤖 Ich biete derzeit **keinen Support** an. Ich habe die App für meinen eigenen Gebrauch entwickelt und hoffe, dass sie in ihrer jetzigen Form zumindest für ein paar andere Leute von Interesse ist. Wenn Sie einen *Show-Stopper* eines Fehlers finden und mir wirklich davon erzählen möchten, wenden Sie sich bitte <a href='#on-mastodon'>an mastodon</a>.
es: 🤖 No ** ofrezco asistencia** en este momento. Desarrollé la aplicación para mi propio uso y espero que sea de interés para al menos algunas otras personas en su forma actual. Si encuentras un *show-stopper* de un error y realmente quieres contármelo, ponte <a href='#on-mastodon'>en contacto con mastodon</a>.
fr: 🤖 Je n'offre **pas d'aide** pour le moment. J'ai développé l'application pour mon propre usage et j'espère qu'elle intéressera au moins quelques autres personnes dans sa forme actuelle. Si vous trouvez un *show-stopper* d'un bug et que vous voulez vraiment m'en parler, veuillez me contacter <a href='#on-mastodon'>sur mastodon</a>.

# qa_languages_q
source: What about other languages?
de: 🤖 Sonstige Sprachen?
es: 🤖 ¿Qué pasa con otros idiomas?
fr: 🤖 Et les autres langues ?

# qa_languages_a
source: I'm very interested in making the app useful to writers in **non-English languages**, particularly *right-to-left writing systems* and other non-latin based scripts. I have a weblate project on codeberg for managing localisations. If this is something you'd like to help me work through to extend the utility of the app to new users please get in touch <a href='#on-mastodon'>on mastodon</a>.
de: 🤖 Ich bin sehr daran interessiert, die App für Autoren in **nicht-englischen Sprachen** nützlich zu machen, insbesondere * rechts-nach-links-Schreibsysteme* und andere nicht lateinische Skripte. Ich habe eine Weblate-Instanz auf Codeberg für die Verwaltung von Lokalisierungen. Wenn Sie mir dabei helfen möchten, den Nutzen der App für neue Benutzer zu erweitern, wenden Sie sich bitte <a href='#on-mastodon'>an mastodon</a>.
es: 🤖 Estoy muy interesado en hacer que la aplicación sea útil para escritores en **idiomas no ingleses**, particularmente * sistemas de escritura de derecha a izquierda * y otros guiones no basados en latín. Tengo una instancia de web en codeberg para gestionar las localizaciones. Si esto es algo que te gustaría ayudarme a trabajar para extender la utilidad de la aplicación a nuevos usuarios, ponte <a href='#on-mastodon'>en contacto con mastodon</a>.
fr: 🤖 Je suis très intéressé à rendre l'application utile aux écrivains en **langues non anglaises**, en particulier * systèmes d'écriture de droite à gauche * et autres scripts non latins. J'ai une instance weblate sur codeberg pour gérer les localisations. Si vous souhaitez m'aider à étendre l'utilité de l'application à de nouveaux utilisateurs, veuillez me contacter <a href='#on-mastodon'>sur mastodon</a>.

# qa_drm_q
source: What about DRM?
de: 🤖 Über was?
es: 🤖 ¿y?
fr: 🤖 A quel propos ?

# qa_drm_a
source: People smarter than I am have worked on this and only managed to create easily breakable protections for digital books. I have **zero time** for thinking about restricting access to digital media created with this software. Use this app to make stuff for your **friends and family** so you don't need to worry about locking it down.
de: 🤖 Menschen, die klüger sind als ich, haben daran gearbeitet und leicht zerbrechliche Schutzvorrichtungen für digitale Bücher geschaffen. Ich habe **null Zeit**, darüber nachzudenken, den Zugriff auf digitale Medien, die mit dieser Software erstellt wurden, einzuschränken. Verwenden Sie diese App, um Dinge für Ihre **Freunde und Familie** zu erstellen. Lassen Sie die Unternehmen ihre eigenen Interessen verwalten.
es: 🤖 Personas más inteligentes que yo han trabajado en esto y han creado protecciones fácilmente rompibles para los libros digitales. Tengo ** tiempo cero ** para pensar en restringir el acceso a los medios digitales creados con este software. Usa esta app para hacer cosas para tus **amigos y familiares**. Deje que las corporaciones gestionen sus propios intereses.
fr: 🤖 Des personnes plus intelligentes que moi y ont travaillé et ont créé des protections facilement cassables pour les livres numériques. J'ai **zéro temps** pour penser à restreindre l'accès aux médias numériques créés avec ce logiciel. Utilisez cette application pour créer des articles pour vos **amis et votre famille**. Laissez les entreprises gérer leurs propres intérêts.

# qa_stack_q
source: What is the project stack?
de: 🤖 Was ist der Projekt-Stack?
es: 🤖 ¿Qué es la pila de proyectos?
fr: 🤖 Quelle est la pile de projets ?

# qa_stack_a
source: Written in **Typescript** using **Svelte 5** with a vite 6.3 dev environment on node v20.18. Builds to a single **SEED.html** file using `vite-plugin-singlefile` to inline scripts, styles and other assets. It uses browser APIs: - `Compression Stream` and `Decompression Stream` for packing/unpacking .epub files - `OPFS` and `IndexedDB` for storing file data - `blob urls` for making assets available for local preview This architecture makes it convenient to embed into a web page, like you can see on [stewarthaines.com/epub](https://stewarthaines.com/epub) which is hosted on github pages, and served via the Cloudflare cache.
de: 🤖 Geschrieben in **Typescript** mit **Svelte 5** und einer vite 6.3 Entwicklungsumgebung auf node v20.18. Wird zu einer einzigen HTML-Datei mit `vite-plugin-singlefile` mit eingebetteten Skripten/Styles/Assets kompiliert. Es verwendet Browser-APIs: - `Compression Stream` und `Decompression Stream` zum Verpacken/Entpacken von .epub-Dateien - `OPFS` und `IndexedDB` zur Speicherung von Dateidaten - `blob urls` um Assets für die lokale Vorschau verfügbar zu machen Diese Architektur macht es bequem, sie in eine Webseite einzubetten, wie Sie auf [stewarthaines.com/epub](https://stewarthaines.com/epub) sehen können, die auf GitHub Pages gehostet und über den Cloudflare-Cache bereitgestellt wird.
es: 🤖 Escrita en **Typescript** usando **Svelte 5** con un entorno de desarrollo vite 6.3 en node v20.18. Se compila a un solo archivo html usando `vite-plugin-singlefile` con scripts/estilos/assets incluidos. Usa APIs del navegador: - `Compression Stream` y `Decompression Stream` para empaquetar/desempaquetar archivos .epub - `OPFS` e `IndexedDB` para almacenar datos de archivos - `blob urls` para hacer disponibles los assets para previsualización local Esta arquitectura hace conveniente embebería en una página web, como puedes ver en [stewarthaines.com/epub](https://stewarthaines.com/epub) que está hospedada en GitHub Pages y servida a través del caché de Cloudflare.
fr: 🤖 Écrite en **Typescript** utilisant **Svelte 5** avec un environnement de développement vite 6.3 sur node v20.18. Se compile en un seul fichier HTML utilisant `vite-plugin-singlefile` avec des scripts/styles/assets intégrés. Elle utilise des APIs de navigateur : - `Compression Stream` et `Decompression Stream` pour empaqueter/désempaqueter des fichiers .epub - `OPFS` et `IndexedDB` pour stocker les données de fichiers - `blob urls` pour rendre les assets disponibles pour la prévisualisation locale Cette architecture rend pratique de l'intégrer dans une page web, comme vous pouvez le voir sur [stewarthaines.com/epub](https://stewarthaines.com/epub) qui est hébergé sur GitHub Pages et servi via le cache Cloudflare.

# qa_process_q
source: What was the development process?
de: 🤖 <ph id="mtc_1" equiv-text="base64:Jmx0O2ImZ3Q7"/>Wie<bx id="2"/> war der Entwicklungsprozess?
es: 🤖 ¿Cuál fue el proceso de desarrollo?
fr: 🤖 Quel a été le processus de développement ?

# qa_process_a
source: **All application code and tests** for this version of the app were produced using [Anthropic's Claude Code](https://claude.ai/code) product, mostly with the Sonnet 3.7 and 4 models. I previously wrote a version using claude with a **VueJS** stack ([v0.3.0 here while it lasts](https://stewarthaines.com/epub/indexeddb/EDITME.html#/) that included `markdown-it`), and before that wrote a VueJS version "manually" (check out v0.2.0 [here](https://stewarthaines.com/epub/full/EDITME.html#/)) that used Remark from the Unified ecosystem. The ideas have been well worked over in this process but I expect this is **not the ultimate form** of a scriptable browser-based EPUB authoring environment.
de: 🤖 **Alle Anwendungscodes und Tests** für diese Version der App wurden mit dem Produkt [Anthropic's Claude Code](https://claude.ai/code) erstellt, hauptsächlich mit den Sonnet 3.7- und 4-Modellen. Ich habe zuvor eine Version mit Claude mit einem **VueJS** -Stack geschrieben und davor eine VueJS-Version *"manuell"*. Die Ideen wurden in diesem Prozess gut überarbeitet, aber ich gehe davon aus, dass dies **nicht die ultimative Form** einer skriptfähigen browserbasierten EPUB-Authoring-Umgebung ist.
es: 🤖 **Todo el código de aplicación y las pruebas** para esta versión de la aplicación se produjeron utilizando el producto [Claude Code de Anthropic](https://claude.ai/code), principalmente con los modelos Sonnet 3.7 y 4. Anteriormente escribí una versión usando claude con una pila **VueJS**, y antes de eso escribí una versión de VueJS *"manualmente"*. Las ideas han sido bien trabajadas en este proceso, pero espero que esta **no sea la forma definitiva** de un entorno de creación EPUB basado en navegador con scripts.
fr: 🤖 **Tous les codes d'application et les tests** pour cette version de l'application ont été produits à l'aide du produit [Code Claude d'Anthropic](https://claude.ai/code), principalement avec les modèles Sonnet 3.7 et 4. J'ai précédemment écrit une version en utilisant claude avec une pile **VueJS**, et avant cela, j'ai écrit une version VueJS *"manuellement"*. Les idées ont été bien travaillées dans ce processus, mais je pense que ce n'est **pas la forme ultime ** d'un environnement de création ePub basé sur un navigateur scriptable.

# qa_who_q
source: Who made this?
de: 🤖 Wer hat das gemacht?
es: 🤖 ¿Quién creó el juego?
fr: 🤖 Qui a fait ça?

# qa_who_a
source: My name is **Stewart Haines**. I live in Naarm/Melbourne, Australia. I'm <span id='on-mastodon'>on Mastodon</span> to support this project as [@editme@mastodon.social](https://mastodon.social/@editme) (SEED.html)
de: 🤖 Mein Name ist **Stewart Haines**. Ich lebe in Melbourne/Naarm, Australien. Ich bin <span id='on-mastodon'>auf Mastodon</span>, um dieses Projekt als [@editme@mastodon.social](https://mastodon.social/@editme) zu unterstützen (SEED.html)
es: 🤖 Mi nombre es **Stewart Haines**. Vivo en Melbourne/Naarm, Australia. Estoy <span id='on-mastodon'>en Mastodon</span> para apoyar este proyecto como [@editme@mastodon.social](https://mastodon.social/@editme) (SEED.html)
fr: 🤖 Je m'appelle **Stewart Haines**. Je vis à Melbourne/Naarm, en Australie. Je suis <span id='on-mastodon'>sur Mastodon</span> pour soutenir ce projet en tant que [@editme@mastodon.social](https://mastodon.social/@editme) (SEED.html)
