Repository: stewarthaines/stewarthaines.com
Catalog: locales/*.po
Languages: de, es, fr

# audience_authors
source: Book Authors
de: Buchautoren
es: Autores de Libros
fr: Auteurs de Livres

# audience_designers
source: For Designers
de: Buchdesigner
es: Diseñadores de Libros
fr: Concepteurs de Livres

# audience_developers
source: For Developers
de: Buchentwickler
es: Desarrolladores de Libros
fr: Développeurs de Livres

# feature_debugging
source: Browser-Based Debugging
de: Browser-basiertes Debugging
es: Depuración en Navegador
fr: Débogage en Navigateur

# feature_debugging_desc
source: Use familiar developer tools for debugging and performance evaluation.
de: Verwenden Sie vertraute Entwicklertools zum Debuggen von Skripten und zur Leistungsoptimierung.
es: Usa herramientas de desarrollador familiares para depurar scripts y optimización de rendimiento.
fr: Utilisez des outils de développement familiers pour déboguer les scripts et l'optimisation des performances.

# feature_instant_epub
source: Valid EPUB
de: Sofort-EPUB
es: EPUB Instantáneo
fr: EPUB Instantané

# feature_instant_epub_desc
source: Generate valid EPUB 3.2 files instantly with proper structure and metadata for accessibility.
de: Erstellen Sie sofort gültige EPUB 3.2-Dateien mit ordnungsgemäßer Struktur und Metadaten.
es: Genera archivos EPUB 3.2 válidos al instante con estructura y metadatos adecuados.
fr: Générez instantanément des fichiers EPUB 3.2 valides avec une structure et des métadonnées appropriées.

# feature_live_preview
source: Live Layout Preview
de: Live-Layout-Vorschau
es: Vista Previa en Vivo
fr: Aperçu en Direct

# feature_live_preview_desc
source: See real-time layout changes across different device screens and orientations.
de: Sehen Sie Layout-Änderungen in Echtzeit auf verschiedenen Gerätebildschirmen und Ausrichtungen.
es: Ve cambios de diseño en tiempo real en diferentes pantallas y orientaciones de dispositivos.
fr: Voyez les changements de mise en page en temps réel sur différents écrans et orientations d'appareils.

# feature_no_install
source: No Installation
de: Keine Installation
es: Sin Instalación
fr: Aucune Installation

# feature_no_install_desc
source: Browser-based tool that works offline as well. No software to install.
de: Browser-basiertes Tool, das offline funktioniert. Keine Software zum Herunterladen oder Installieren.
es: Herramienta basada en navegador que funciona sin conexión. No hay software que descargar o instalar.
fr: Outil basé sur navigateur qui fonctionne hors ligne. Aucun logiciel à télécharger ou installer.

# feature_plain_text
source: Plain Text Input
de: Einfacher Text
es: Entrada de Texto Plano
fr: Saisie de Texte Brut

# feature_plain_text_desc
source: Write your content in simple plain text format. No complex markup required.
de: Schreiben Sie Ihren Inhalt im einfachen Textformat. Keine komplexe Auszeichnung erforderlich.
es: Escribe tu contenido en formato de texto plano. No se requiere marcado complejo.
fr: Rédigez votre contenu en format texte brut simple. Aucun balisage complexe requis.

# feature_rapid_iteration
source: Rapid Iteration
de: Schnelle Iteration
es: Iteración Rápida
fr: Itération Rapide

# feature_rapid_iteration_desc
source: Avoid device round trips when testing responsive and interactive behaviours.
de: Schnelles Testen von benutzerdefinierten JavaScript-Verhalten und interaktiven Elementen.
es: Pruebas rápidas de comportamientos JavaScript personalizados y elementos interactivos.
fr: Test rapide de comportements JavaScript personnalisés et d'éléments interactifs.

# feature_responsive_design
source: Responsive Design
de: Responsive Design-Tests
es: Pruebas de Diseño Responsivo
fr: Test de Design Réactif

# feature_responsive_design_desc
source: Test typography, margins, and layouts on mobile, tablet, and desktop screen sizes instantly.
de: Testen Sie Typografie, Ränder und Layouts auf Mobilgeräten, Tablets und Desktop sofort.
es: Prueba tipografía, márgenes y diseños en móvil, tablet y escritorio al instante.
fr: Testez la typographie, les marges et les mises en page sur mobile, tablette et bureau instantanément.

# feature_third_party
source: Integrated Scripting
de: Drittanbieter-Integration
es: Integración de Terceros
fr: Intégration Tierce

# feature_third_party_desc
source: Add extension libraries, custom build-time scripts and Reading System scripts.
de: Testen Sie externe Bibliotheken, Analytik und benutzerdefinierte Skripte in der EPUB-Umgebung.
es: Prueba librerías externas, analíticas y scripts personalizados dentro del entorno EPUB.
fr: Testez des bibliothèques externes, des analyses et des scripts personnalisés dans l'environnement EPUB.

# feature_visual_feedback
source: Visual Design Feedback
de: Visuelles Feedback
es: Retroalimentación Visual
fr: Retour Visuel

# feature_visual_feedback_desc
source: Immediate visual feedback for cover design, chapter breaks, and formatting choices.
de: Sofortiges visuelles Feedback für Cover-Design, Kapitelumbrüche und Formatierungsoptionen.
es: Retroalimentación visual inmediata para diseño de portada, saltos de capítulo y elecciones de formato.
fr: Retour visuel immédiat pour la conception de couverture, les sauts de chapitre et les choix de formatage.

# hero_description
source: The Simplest way to create Semantic, Scripted EPUB books
de: Einfachen Text in EPUB umwandeln - der einfachste Weg, EPUB-Dateien zu erstellen
es: Convierte texto plano a EPUB - la forma más simple de crear archivos EPUB
fr: Convertir du texte brut en EPUB - le moyen le plus simple de créer des fichiers EPUB

# iframe_title
source: EDITME.html - EPUB Creation Tool
de: EDITME.html - EPUB-Erstellungstool
es: EDITME.html - Herramienta de Creación EPUB
fr: EDITME.html - Outil de Création EPUB

# choose_role_legend
source: Choose your role to see relevant features
de: Wählen Sie Ihre Rolle, um relevante Funktionen zu sehen
es: Elige tu función para ver características relevantes
fr: Choisissez votre rôle pour voir les fonctionnalités pertinentes

source: current
de: aktuell
es: actual
fr: actuel

# feature_details_heading
source: Feature Details
de: Funktionsdetails
es: Detalles de Características
fr: Détails des Fonctionnalités

# interactive_epub_tool_heading
source: Interactive EPUB Creation Tool
de: Interaktives EPUB-Erstellungstool
es: Herramienta Interactiva de Creación EPUB
fr: Outil Interactif de Création EPUB

source: Language selection
de: Sprachauswahl
es: Selección de idioma
fr: Sélection de langue

# meta_description
source: Convert plain text to EPUB - the simplest way to create EPUB files
de: Klartext in EPUB konvertieren - der einfachste Weg, EPUB-Dateien zu erstellen
es: Convierte texto plano a EPUB - la forma más simple de crear archivos EPUB
fr: Convertir du texte brut en EPUB - la façon la plus simple de créer des fichiers EPUB

# open_tool_new_window
source: Open SEED.html in a new window
de: EPUB-Tool in neuem Fenster öffnen
es: Abrir herramienta EPUB en nueva ventana
fr: Ouvrir l'outil EPUB dans une nouvelle fenêtre

# opens_new_tab
source: opens in new tab
de: öffnet in neuem Tab
es: se abre en nueva pestaña
fr: s'ouvre dans un nouvel onglet

# skip_to_main
source: Skip to main content
de: Zum Hauptinhalt springen
es: Saltar al contenido principal
fr: Aller au contenu principal

source: version
es: versión

source: View features for
de: Funktionen anzeigen für
es: Ver características para
fr: Voir les fonctionnalités pour

# qa_why_app_q
source: Why does this app exist?
de: 🤖 Warum diese App?
es: 🤖 ¿Por qué hemos lanzado esta aplicación?
fr: 🤖 Pourquoi cette application ?

# qa_why_app_a
source: I wrote it for myself to use experimenting with **scripted content** in EPUB. The EPUB 3 format is mature and well supported, but the tooling for authoring EPUB treats it as a *destination format* - equivalent to a PDF or other proprietary book formats - at the end of a lowest common denominator content pipeline. The currently available EPUB Reading Systems (like Apple's Books app, and Cantook by Aldiko) support rich, web-like content because they're based on web browsers. I want to explore the possibilities of EPUB interactivity but none of the existing software I've seen supports the kind of development experience I desire. This app does that and meets my needs in its present form.
de: 🤖 Ich habe sie für mich selbst geschrieben, weil ich eine Umgebung wollte, in der ich mit **skriptgesteuerten Inhalten** in EPUB experimentieren kann. Das EPUB 3-Format ist ausgereift und gut unterstützt, aber die Tools zur EPUB-Erstellung behandeln es als *Zielformat* - gleichwertig mit PDF oder anderen proprietären Buchformaten - am Ende einer Pipeline mit dem kleinsten gemeinsamen Nenner. Die aktuellen EPUB-Lesesysteme (wie Apples Books-App und Cantook von Aldiko) unterstützen webartige, reichhaltige Inhalte, weil sie auf Webbrowser-Software basieren. Ich möchte die Möglichkeiten erkunden, aber keine der vorhandenen Software, die EPUB-Dateien erstellt, unterstützt die Art von Entwicklungserfahrung, die ich beim Arbeiten mit dem Web-Stack erwarte. Ich möchte **sofortige Änderungen bei Inhalt/Stil/Layout/Verhalten** sehen, wenn ich eine Änderung vornehme. Diese App macht das und erfüllt bereits meine Bedürfnisse.
es: 🤖 La escribí para mí mismo, queriendo un entorno en el que pudiera experimentar con **contenido con scripts** en EPUB. El formato EPUB 3 está maduro y bien soportado, pero las herramientas para crear EPUB lo tratan como un *formato de destino* - equivalente a PDF u otros formatos de libro propietarios - al final de una pipeline de contenido del mínimo común denominador. Los sistemas actuales de lectura EPUB (como la app Books de Apple y Cantook de Aldiko) soportan contenido rico tipo web porque están basados en software de navegador web. Quiero explorar las posibilidades, pero ninguno del software existente que produce archivos EPUB soporta el tipo de experiencia de desarrollo que espero cuando trabajo con el stack web. Quiero ver **cambios inmediatos de contenido/estilo/diseño/comportamiento** cuando hago un cambio. Esta app hace eso y ya satisface mis necesidades.
fr: 🤖 Je l'ai écrite pour moi-même, voulant un environnement dans lequel je peux expérimenter avec du **contenu scripté** dans EPUB. Le format EPUB 3 est mature et bien supporté, mais les outils de création EPUB le traitent comme un *format de destination* - équivalent à PDF ou autres formats de livres propriétaires - à la fin d'un pipeline de contenu du plus petit dénominateur commun. Les systèmes de lecture EPUB actuels (comme l'app Books d'Apple, et Cantook d'Aldiko) supportent du contenu riche type web parce qu'ils sont basés sur des logiciels de navigateur web. Je veux explorer les possibilités mais aucun des logiciels existants qui produit des fichiers EPUB ne supporte le type d'expérience de développement que j'attends en travaillant avec la pile web. Je veux voir **des changements immédiats de contenu/style/mise en page/comportement** quand je fais un changement. Cette app fait cela et répond déjà à mes besoins.

# qa_browsers_q
source: Supported Browsers
de: 🤖 Unterstützte Browser
es: 🤖 Navegadores compatibles
fr: 🤖 Navigateurs Supportés

# qa_browsers_a
source: The SEED.html app should run as designed on recent **Safari**, **Chrome**, **Edge** and **Firefox** browsers. Other Chromium-based browsers should also work. The app will work in these browsers on **iOS**, **macOS**, **Linux**, **Windows** and **Android**. The app is available at [stewarthaines.com/epub](https://stewarthaines.com/epub) and can also be downloaded as a self-contained SEED.html file, then run from the local filesystem, whether on a computer or a mobile device.
de: 🤖 Die App SEED.html sollte auf den aktuellen Browsern **Safari**, **Chrome**, **Edge** und **Firefox** ausgeführt werden. Andere auf Chrom basierende Browser sollten ebenfalls funktionieren. Die App funktioniert in diesen Browsern auf **iOS/iPadOS/macOS**, **Linux**, **Windows** und **Android**. Die App ist unter [stewarthaines.com/epub](https://stewarthaines.com/epub) verfügbar und kann auch vom lokalen Dateisystem heruntergeladen und ausgeführt werden, egal ob auf einem Computer oder einem mobilen Gerät.
es: 🤖 La aplicación SEED.html debe ejecutarse como se diseñó en los navegadores **Safari**, **Chrome**, **Edge** y **Firefox** recientes. Otros navegadores basados en Chromium también deberían funcionar. La aplicación funcionará en estos navegadores en **iOS/iPadOS/macOS**, **Linux**, **Windows** y **Android**. La aplicación está disponible en [stewarthaines.com/epub](https://stewarthaines.com/epub) y también se puede descargar y ejecutar desde el sistema de archivos local, ya sea en un ordenador o en un dispositivo móvil.
fr: 🤖 L'application SEED.html doit fonctionner comme prévu sur les navigateurs **Safari**, **Chrome**, **Edge** et **Firefox** récents. D'autres navigateurs à base de chrome devraient également fonctionner. L'application fonctionnera dans ces navigateurs sur **iOS/iPadOS/macOS**, **Linux**, **Windows** et **Android**. L'application est disponible sur [stewarthaines.com/epub](https://stewarthaines.com/epub) et peut également être téléchargée et exécutée à partir du système de fichiers local, que ce soit sur un ordinateur ou un appareil mobile.

# qa_where_files_q
source: Where are my files?
de: 🤖 Wo werden meine Dateien gespeichert?
es: 🤖 ¿Dónde están mis archivos?
fr: 🤖 où sont mes fichiers ?

# qa_where_files_a
source: The SEED.html app runs in your web browser, and uses browser-managed local storage to store your files. **Nothing is sent to a server.** The way the files are stored means you are not able to locate them on your local file system - they're only available through the browser app. The *'Package EPUB'* button creates a file and downloads it to wherever your browser normally downloads files. Everything is stored in the EPUB, so this is where your files are ultimately. My workflow treats the .epub file as the resource I need to back up. I don't tend to rely on the Projects view for storing work. Make sure your .epub files are backed up. **Technical answer:** They're in either the browser's Origin Private File System or in an IndexedDB store, depending on the browser and whether the app was loaded over `http:` or from a `file:` url.
de: 🤖 Die SEED.html-App läuft in Ihrem Webbrowser und verwendet den vom Browser verwalteten lokalen Cache zur Speicherung Ihrer Dateien. **Es wird nichts an einen Server gesendet.** Die besondere Art der Dateispeicherung bedeutet, dass Sie sie nicht auf Ihrem lokalen Dateisystem finden können - sie sind nur über die Browser-App verfügbar. Der *'EPUB verpacken'*-Button erstellt eine Datei und lädt sie in den Ordner herunter, in den Ihr Browser normalerweise Dateien herunterlädt. Alles wird im EPUB gespeichert, dort befinden sich also letztendlich Ihre Dateien. Der Klartext-Quellinhalt und Skripte werden in einem Manifest-Element namens `SOURCE.zip` gespeichert. **Technische Antwort:** Sie befinden sich entweder im Origin Private File System des Browsers oder in einem IndexedDB-Speicher, abhängig davon, welcher Browser verwendet wird und ob die App über `http:` oder von einer `file:`-URL geladen wurde.
es: 🤖 La app SEED.html se ejecuta en tu navegador web y usa caché local gestionado por el navegador para almacenar tus archivos. **Nada se envía a un servidor.** La forma particular en que se almacenan los archivos significa que no puedes encontrarlos en tu sistema de archivos local - solo están disponibles a través de la app del navegador. El botón *'Empaquetar EPUB'* crea un archivo y lo descarga donde tu navegador normalmente descarga archivos. Todo se almacena en el EPUB, así que ahí es donde están finalmente tus archivos. El contenido fuente de texto plano y los scripts se almacenan en un elemento manifest llamado `SOURCE.zip`. **Respuesta técnica:** Están en el Sistema de Archivos Privado de Origen del navegador o en un almacén IndexedDB, dependiendo de qué navegador y si la app se cargó por `http:` o desde una URL `file:`.
fr: 🤖 L'app SEED.html s'exécute dans votre navigateur web et utilise un cache local géré par le navigateur pour stocker vos fichiers. **Rien n'est envoyé à un serveur.** La façon particulière dont les fichiers sont stockés signifie que vous ne pouvez pas les trouver sur votre système de fichiers local - ils ne sont disponibles qu'à travers l'app du navigateur. Le bouton *'Empaqueter EPUB'* crée un fichier et le télécharge où votre navigateur télécharge normalement les fichiers. Tout est stocké dans l'EPUB, c'est donc là que sont finalement vos fichiers. Le contenu source en texte brut et les scripts sont stockés dans un élément de manifeste appelé `SOURCE.zip`. **Réponse technique :** Ils sont soit dans le Système de Fichiers Privé d'Origine du navigateur soit dans un magasin IndexedDB, selon le navigateur et si l'app a été chargée via `http:` ou depuis une URL `file:`.

# qa_validation_q
source: EPUB Validation
de: 🤖 EPUB-Validierung
es: 🤖 Validación EPUB
fr: 🤖 Validation ePub

# qa_validation_a
source: It's important that the packaged epub file passes validation. The SEED.html app can't guarantee that the content will be valid when packaged. Even a small typo in a css file can cause validation to fail, though the EPUB might still be readable when side-loaded or imported to a device. I use the [pagina EPUB-Checker](https://pagina.gmbh/startseite/leistungen/publishing-softwareloesungen/epub-checker/) for validation.
de: 🤖 Es ist **wichtig**, dass die verpackte epub-Datei die Validierung besteht. Die App SEED.html kann nicht garantieren, dass der Inhalt gültig ist. Selbst ein kleiner Tippfehler in einer CSS-Datei kann dazu führen, dass die Validierung fehlschlägt, obwohl der EPUB möglicherweise immer noch lesbar ist, wenn er von der Seite geladen oder auf ein Gerät importiert wird. Zur Validierung nutze ich den [pagina EPUB-Checker](https://pagina.gmbh/startseite/leistungen/publishing-softwareloesungen/epub-checker/).
es: 🤖 Es **importante** que el archivo epub empaquetado pase la validación. La aplicación SEED.html no puede garantizar que el contenido sea válido. Incluso un pequeño error tipográfico en un archivo css puede hacer que la validación falle, aunque el EPUB aún puede ser legible cuando se carga lateralmente o se importa a un dispositivo. Utilizo la [página EPUB-Checker](https://pagina.gmbh/startseite/leistungen/publishing-softwareloesungen/epub-checker/) para la validación.
fr: 🤖 Il est **important** que le fichier epub empaqueté passe la validation. L'application SEED.html ne peut pas garantir que le contenu sera valide. Même une petite faute de frappe dans un fichier css peut entraîner un échec de la validation, bien que l'ePub puisse toujours être lisible lorsqu'il est chargé latéralement ou importé sur un périphérique. J'utilise le [pagina ePub-Checker](https://pagina.gmbh/startseite/leistungen/publishing-softwareloesungen/epub-checker/) pour la validation.

# qa_reading_apps_q
source: EPUB Reading apps
de: 🤖 Lesen von Apps
es: 🤖 Aplicaciones de lectura EPUB
fr: 🤖 Applications de lecture ePub

# qa_reading_apps_a
source: In **2025** I've found good support for EPUB 3 with interactive content in these applications: - [Books app](https://www.apple.com/apple-books/) on iOS and macOS - [Cantook by Aldiko](https://pro.cantook.com/en/l-application-cantook) on Android and iOS - [Reasily](https://reasily.blogspot.com/) on Android - [Thorium Reader](https://thorium.edrlab.org/) by EDRLab on macOS, Windows andLinux - [BookFusion](https://www.bookfusion.com/) on iOS and Android - [Lis-a](https://lis-a.fr/en/) on iOS and Android I expect that there are others I don't know about yet.
de: 🤖 In **2025** habe ich gute Unterstützung für EPUB 3 mit interaktiven Inhalten in diesen Anwendungen gefunden: - [Books app](https://www.apple.com/apple-books/) auf iOS/iPadOS/macOS - [Cantook by Aldiko](https://pro.cantook.com/en/l-application-cantook) auf Android/iOS - [Reasily](https://reasily.blogspot.com/) auf Android - [Thorium Reader](https://thorium.edrlab.org/) von EDRLab auf macOS/Windows/Linux - [BookFusion](https://www.bookfusion.com/) auf iOS/Android Ich erwarte, dass es noch andere gibt, die ich noch nicht kenne.
es: 🤖 En **2025** he encontrado buen soporte para EPUB 3 con contenido interactivo en estas aplicaciones: - [Books app](https://www.apple.com/apple-books/) en iOS/iPadOS/macOS - [Cantook by Aldiko](https://pro.cantook.com/en/l-application-cantook) en Android/iOS - [Reasily](https://reasily.blogspot.com/) en Android - [Thorium Reader](https://thorium.edrlab.org/) por EDRLab en macOS/Windows/Linux - [BookFusion](https://www.bookfusion.com/) en iOS/Android Espero que haya otras que aún no conozco.
fr: 🤖 En **2025** j'ai trouvé un bon support pour EPUB 3 avec du contenu interactif dans ces applications : - [Books app](https://www.apple.com/apple-books/) sur iOS/iPadOS/macOS - [Cantook by Aldiko](https://pro.cantook.com/en/l-application-cantook) sur Android/iOS - [Reasily](https://reasily.blogspot.com/) sur Android - [Thorium Reader](https://thorium.edrlab.org/) par EDRLab sur macOS/Windows/Linux - [BookFusion](https://www.bookfusion.com/) sur iOS/Android Je m'attends à ce qu'il y en ait d'autres que je ne connais pas encore.

# qa_freeware_q
source: Why a freeware license?
de: 🤖 Warum eine Freeware-Lizenz?
es: 🤖 ¿Por qué una licencia freeware?
fr: 🤖 Pourquoi une licence freeware ?

# qa_freeware_a
source: I want you to be able to use it as much as you like for **personal, non-commercial projects** for no cost to you. You can share it with others under the same terms. It's *<u>not</u> open source* at this time. If you like using it and want to _contribute_ to support the continuing development that would be great! I have a LiberaPay account here in my name: <script src='/images/button.js'></script> <noscript><a href='https://liberapay.com/stewarthaines/donate'><img alt='Contribute using Liberapay' src='/images/contribute.svg'></a></noscript>
de: 🤖 Ich möchte, dass Sie es so viel nutzen können, wie Sie möchten, für **persönliche, nicht-kommerzielle Projekte** ohne Kosten für Sie. Sie können es unter denselben Bedingungen mit anderen teilen. Es ist derzeit *nicht Open Source*. Wenn Ihnen die Nutzung gefällt und Sie _spenden_ möchten, um die weitere Entwicklung zu unterstützen, wäre das großartig! Ich habe hier ein LiberaPay-Konto auf meinen Namen: <script src='https://liberapay.com/stewarthaines/widgets/button.js'></script> <noscript><a href='https://liberapay.com/stewarthaines/donate'><img alt='Spenden Sie mit Liberapay' src='https://liberapay.com/assets/widgets/donate.svg'></a></noscript>
es: 🤖 Quiero que puedas usarla tanto como quieras para **proyectos personales, no comerciales** sin costo para ti. Puedes compartirla con otros bajo las mismas condiciones. *No es código abierto* en este momento. ¡Si te gusta usarla y quieres _donar_ para apoyar el desarrollo continuo, sería genial! Tengo una cuenta de LiberaPay aquí a mi nombre: <script src='https://liberapay.com/stewarthaines/widgets/button.js'></script> <noscript><a href='https://liberapay.com/stewarthaines/donate'><img alt='Dona usando Liberapay' src='https://liberapay.com/assets/widgets/donate.svg'></a></noscript>
fr: 🤖 Je veux que vous puissiez l'utiliser autant que vous le souhaitez pour des **projets personnels, non commerciaux** sans frais pour vous. Vous pouvez le partager avec d'autres sous les mêmes conditions. Ce n'est *pas open source* pour le moment. Si vous aimez l'utiliser et souhaitez _faire un don_ pour soutenir le développement continu, ce serait formidable ! J'ai un compte LiberaPay ici à mon nom : <script src='https://liberapay.com/stewarthaines/widgets/button.js'></script> <noscript><a href='https://liberapay.com/stewarthaines/donate'><img alt='Faire un don avec Liberapay' src='https://liberapay.com/assets/widgets/donate.svg'></a></noscript>
